AUTO_config_TK_pesok/src/DataProcessors/ТК_zFoc/ТК_zFoc.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТК_zFoc</name>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/Documents/ТК_КассоваяСменаЗКС/ТК_КассоваяСменаЗКС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТК_КассоваяСменаЗКС</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоКассовойСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеКассовойСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСменыККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаZотчета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерZотчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВозврат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧеков</name>
    <comment>Количество чеков</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЭкваер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

AUTO_config_TK_pesok/src/Documents/ТК_ЗакрытиеСменыЗКС/ТК_ЗакрытиеСменыЗКС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТК_ЗакрытиеСменыЗКС</name>
  <basedOn>Document.ЗакрытиеСмены</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.РозничныеПродажиПодакцизныхТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ПогрешностиДокументов</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиОрганизаций</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентированныйУчет</name>
    <comment>Флаг отражения документа в регламентированном учете</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладКомпании</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <comment>Тип цен отгрузки</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>Валюта документа</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <comment>Курс валюты документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВозврат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЭкваер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписыватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.ТК_КассоваяСменаЗКС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.ЗакрытиеСмены</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика/серия номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество единиц измерения номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>Единица измерения номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБазовое</name>
      <comment>Количество номенклатуры в базовых единицах (коэффициент=1)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>32</precision>
          <scale>12</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС по номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Сумма НДС по номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>32</precision>
          <scale>12</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкцизногоНалога</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>32</precision>
          <scale>12</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <comment>Итоговая сумма по строке документа со всеми налогами</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>32</precision>
          <scale>12</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <comment>Сумма скидки по строке документа</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>32</precision>
          <scale>12</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <comment>Процент скидки</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Возврат</name>
      <comment>Определяет тип операции Истина-возврат, Ложь-продажа</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлассификаторПродажи</name>
      <type>
        <types>CatalogRef.КлассификаторПродаж</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатурыОрганизаций</name>
      <type>
        <types>CatalogRef.ТК_КлючиАналитикиУчетаНоменклатурыОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ОплатаБезнал</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозврата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаПлатежнымиКартами</name>
    <attributes>
      <name>КассаККМ</name>
      <type>
        <types>CatalogRef.КассыККМ</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭквайринговыйТерминал</name>
      <type>
        <types>CatalogRef.ЭквайринговыеТерминалы</types>
      </type>
    </attributes>
    <attributes>
      <name>КодАвторизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПлатежнойКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>22</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/DataProcessors/ТК_zFoc/Forms/ДанныеЗетОтчетов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Период", Период);
	ТолькоРасхождения = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	dbo_STAT_DATESALES.OPDATE КАК OPDATE,
	//	|	dbo_STAT_DATESALES.ZREPFPSN КАК ZREPFPSN,
	//	|	dbo_STAT_DATESALES.SAREAGUID КАК SAREAGUID,
	//	|	dbo_STAT_DATESALES.SAREAID КАК SAREAID,
	//	|	dbo_STAT_DATESALES.SYSTEMID КАК SYSTEMID,
	//	|	dbo_STAT_DATESALES.WORKDAYID КАК WORKDAYID,
	//	|	dbo_STAT_DATESALES.ZREPNUM КАК ZREPNUM,
	//	|	dbo_STAT_DATESALES.SALESSUM КАК SALESSUM,
	//	|	dbo_STAT_DATESALES.REFUNDSUM КАК REFUNDSUM,
	//	|	dbo_STAT_DATESALES.isDOWNLOADED КАК isDOWNLOADED
	//	|ИЗ
	//	|	ВнешнийИсточникДанных.zFOC.Таблица.dbo_STAT_DATESALES КАК dbo_STAT_DATESALES
	//	|ГДЕ
	//	|	dbo_STAT_DATESALES.OPDATE МЕЖДУ &OPDATE1 И &OPDATE2";
	//
	//Запрос.УстановитьПараметр("OPDATE1", Период.ДатаНачала);
	//Запрос.УстановитьПараметр("OPDATE2", Период.ДатаОкончания);
	//
	//тзПродажиПозет = Запрос.Выполнить().Выгрузить();
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТК_ЗакрытиеСменыЗКС.Дата КАК ДатаЗет,
		|	ТК_КассоваяСменаЗКС.Ссылка КАК СсылкаЗет,
		|	ТК_КассоваяСменаЗКС.ТорговаяПлощадка КАК ТорговаяПлощадка,
		|	ТК_КассоваяСменаЗКС.КассаККМ КАК КассаККМ,
		|	ТК_КассоваяСменаЗКС.НомерСменыККМ КАК НомерСменыККМ,
		|	ТК_КассоваяСменаЗКС.НомерZотчета КАК НомерZотчета,
		|	ТК_КассоваяСменаЗКС.СуммаДокумента - ТК_КассоваяСменаЗКС.СуммаВозврат КАК СуммаЗет,
		|	ТК_ЗакрытиеСменыЗКС.СуммаДокумента КАК СуммаЗКС,
		|	ТК_КассоваяСменаЗКС.СуммаВозврат КАК СуммаВозвратЗет,
		|	ТК_ЗакрытиеСменыЗКС.СуммаВозврат КАК СуммаВозвратЗКС,
		|	ТК_КассоваяСменаЗКС.СуммаСкидки КАК СуммаСкидкиЗет,
		|	ТК_ЗакрытиеСменыЗКС.СуммаСкидки КАК СуммаСкидкиЗКС,
		|	ТК_КассоваяСменаЗКС.СуммаЭкваер КАК СуммаЭкваерЗет,
		|	ТК_ЗакрытиеСменыЗКС.СуммаЭкваер КАК СуммаЭкваерЗКС,
		|	ТК_ЗакрытиеСменыЗКС.Ссылка КАК СсылкаЗКС,
		|	ТК_КассоваяСменаЗКС.Организация КАК Организация
		|ИЗ
		|	Документ.ТК_КассоваяСменаЗКС КАК ТК_КассоваяСменаЗКС
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТК_ЗакрытиеСменыЗКС КАК ТК_ЗакрытиеСменыЗКС
		|		ПО ТК_КассоваяСменаЗКС.Ссылка = ТК_ЗакрытиеСменыЗКС.КассоваяСмена
		|			И (ТК_ЗакрытиеСменыЗКС.Проведен)
		|ГДЕ
		|	ТК_КассоваяСменаЗКС.Дата МЕЖДУ &Дата1 И &Дата2
		|	И ТК_ЗакрытиеСменыЗКС.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	СсылкаЗет";
	
	Запрос.УстановитьПараметр("Дата1",  Период.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
		
	ДеревоЗетОтчетов = РеквизитФормыВЗначение("ТаблицаЗетОтчетов");
	СтрокиДерева = ДеревоЗетОтчетов.Строки;
	СтрокиДерева.Очистить();

	
	Пока ВыборкаДетальныеЗаписи.СледующийПоЗначениюПоля("СсылкаЗет") Цикл
		
		СтрокаЗет =  СтрокиДерева.Добавить();
		СтрокаЗет.ЗетОтчет = ВыборкаДетальныеЗаписи.СсылкаЗет;
		СтрокаЗет.Сумма = ВыборкаДетальныеЗаписи.СуммаЗет;
		СтрокаЗет.СуммаВозврат = ВыборкаДетальныеЗаписи.СуммаВозвратЗет;
		СтрокаЗет.СуммаСкидки = ВыборкаДетальныеЗаписи.СуммаСкидкиЗет;
		СтрокаЗет.СуммаЭкваер = ВыборкаДетальныеЗаписи.СуммаЭкваерЗет;
		СтрокаЗет.КассаККМ = ВыборкаДетальныеЗаписи.КассаККМ;
		СтрокаЗет.ТорговаяПлощадка = ВыборкаДетальныеЗаписи.ТорговаяПлощадка;
		СтрокаЗет.НомерЗет = ВыборкаДетальныеЗаписи.НомерZотчета;
		СтрокаЗет.Организация = ВыборкаДетальныеЗаписи.Организация;
		
		СуммаПоЗКС = 0;
		СуммаВозвратПоЗКС = 0;
		СуммаЭкваерПоЗКС = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			 СтрокаЗКС = СтрокаЗет.Строки.Добавить();
			 СтрокаЗКС.ЗетОтчет =ВыборкаДетальныеЗаписи.СсылкаЗКС;
			 СтрокаЗКС.Сумма = ВыборкаДетальныеЗаписи.СуммаЗКС;
			 СтрокаЗКС.СуммаВозврат = ВыборкаДетальныеЗаписи.СуммаВозвратЗКС;
			 СтрокаЗКС.СуммаСкидки = ВыборкаДетальныеЗаписи.СуммаСкидкиЗКС;
			 СтрокаЗКС.СуммаЭкваер = ВыборкаДетальныеЗаписи.СуммаЭкваерЗКС;
 
			 СуммаПоЗКС 	   = СуммаПоЗКС + ВыборкаДетальныеЗаписи.СуммаЗКС;
			 СуммаВозвратПоЗКС = СуммаВозвратПоЗКС + ВыборкаДетальныеЗаписи.СуммаВозвратЗКС;
			 СуммаЭкваерПоЗКС  = СуммаЭкваерПоЗКС + ВыборкаДетальныеЗаписи.СуммаЭкваерЗКС;
		КонецЦикла;
		
		Если СтрокаЗет.Сумма <> СуммаПоЗКС ИЛИ  СтрокаЗет.СуммаВозврат <>  СуммаВозвратПоЗКС  ИЛИ  СтрокаЗет.СуммаЭкваер <>  СуммаЭкваерПоЗКС  Тогда
			СтрокаЗет.ЕстьРасхождения = Истина;
		КонецЕсли;
		СтрокаЗет.СуммаТ        = СуммаПоЗКС;
		СтрокаЗет.СуммаВозвратТ = СуммаВозвратПоЗКС;
		СтрокаЗет.СуммаЭкваерТ  = СуммаЭкваерПоЗКС;
		
		
		Если ТолькоРасхождения И НЕ СтрокаЗет.ЕстьРасхождения Тогда
			СтрокиДерева.Удалить(СтрокаЗет);
		КонецЕсли;
		
		
	КонецЦикла;
	
	 ЗначениеВРеквизитФормы(ДеревоЗетОтчетов,"ТаблицаЗетОтчетов");
	
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
